ПосуточнаяАрендаКвартир/src/Documents/Бронирование/Бронирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Бронирование</name>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектАренды</name>
    <type>
      <types>CatalogRef.ОбъектыАренды</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналБронирования</name>
    <type>
      <types>CatalogRef.КаналыБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыезда</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусБронирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСуток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ПосуточнаяАрендаКвартир/src/Documents/Бронирование/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет табличный документ для печати договора аренды.
//
// Параметры:
//   ТабДок - ТабличныйДокумент;
//   Ссылка - ДокументСсылка.Бронирование.
Процедура ДоговорАренды(ТабДок, Ссылка) Экспорт

    // Получаем объект документа по ссылке
    Док = Ссылка.ПолучитьОбъект();

    // Макет табличного документа (созданный тобой макет "ДоговорАренды")
    Макет   = ПолучитьМакет("ДоговорАренды");
    Область = Макет.ПолучитьОбласть("Основная"); // область в макете

    // Номер без лидирующих нулей
    НомерБезНулей = УдалитьЛидирующиеНули(Док.Номер);

    // Дата без времени
    ДатаБезВремени = НачалоДня(Док.Дата);
    ДатаСтрокой    = Формат(ДатаБезВремени, "ДФ=DD.MM.YYYY");

    // Сумма прописью
    ФормСтрока    = "Л=ru_RU; НП=Истина; НД=Истина; ДП=Истина";
    ПарамПредмета = "рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
    СуммаПрописью = ЧислоПрописью(Док.Стоимость, ФормСтрока, ПарамПредмета);

    // Заполняем параметры области макета
    Область.Параметры.НомерДокумента  = НомерБезНулей;
    Область.Параметры.ДатаДокумента   = ДатаСтрокой;
    Область.Параметры.Клиент          = Док.Клиент;
    Область.Параметры.ОбъектАренды    = Док.ОбъектАренды;
    Область.Параметры.ДатаЗаезда      = Док.ДатаЗаезда;
    Область.Параметры.ДатаВыезда      = Док.ДатаВыезда;
    Область.Параметры.КоличествоСуток = Док.КоличествоСуток;
    Область.Параметры.ЦенаЗаСутки     = Док.ЦенаЗаСутки;
    Область.Параметры.Стоимость       = Док.Стоимость;
    Область.Параметры.СуммаПрописью   = СуммаПрописью;

    // Вывод в табличный документ
    ТабДок.Очистить();
    ТабДок.Вывести(Область);

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Удалить ведущие нули из номера документа
Функция УдалитьЛидирующиеНули(СтрокаНомера) Экспорт

    Результат = СтрокаНомера;
    Пока СтрНачинаетсяС(Результат, "0") Цикл
        Результат = Сред(Результат, 2);
    КонецЦикла;

    Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
